stm32duino/Arduino_Core_STM32/system/Drivers/STM32WL3x_HAL_Driver/Inc/stm32wl3x_ll_lcsc.h
/**
  * @brief  Get the LCB Comparator last damping count
  * @rmtoll COMP_CNT          CMP_LCB_CNT       LL_LCSC_GetComparatorLastDampingCount_LCB
  * @param  LCSCx LCSC Instance
  * @retval the LCB Comparator last damping count
  */
__STATIC_INLINE uint32_t LL_LCSC_GetComparatorLastDampingCount_LCB(LCSC_TypeDef *LCSCx)
{
  return (uint32_t)(READ_BIT(LCSCx->COMP_CNT, LCSC_COMP_CNT_CMP_LCB_CNT) >> LCSC_COMP_CNT_CMP_LCB_CNT_Pos);
}

/**
  * @brief  Get the LCT Comparator last damping count
  * @rmtoll COMP_CNT          CMP_LCT_CNT       LL_LCSC_GetComparatorLastDampingCount_LCT
  * @param  LCSCx LCSC Instance
  * @retval the LCT Comparator last damping count
  */
__STATIC_INLINE uint32_t LL_LCSC_GetComparatorLastDampingCount_LCT(LCSC_TypeDef *LCSCx)
{
  return (uint32_t)(READ_BIT(LCSCx->COMP_CNT, LCSC_COMP_CNT_CMP_LCT_CNT) >> LCSC_COMP_CNT_CMP_LCT_CNT_Pos);
}

/**
  * @brief  Get the current state of the LCSC clockwise FSM
  * @rmtoll SR          CLKWISE_STATE       LL_LCSC_GetClockWise_State
  * @param  LCSCx LCSC Instance
  * @retval can be one of the following values
  * @arg LL_LCSC_SR_CLKWISE_FSM_Q1
  * @arg LL_LCSC_SR_CLKWISE_FSM_Q2
  * @arg LL_LCSC_SR_CLKWISE_FSM_Q3
  * @arg LL_LCSC_SR_CLKWISE_FSM_Q4
  */
__STATIC_INLINE uint32_t LL_LCSC_GetClockWise_State(LCSC_TypeDef *LCSCx)
{
  return (uint32_t)(READ_BIT(LCSCx->SR, LCSC_SR_CLKWISE_STATE));
}

/**
  * @brief  Get the current state of the LCSC anti clockwise FSM
  * @rmtoll SR          ACLKWISE_STATE       LL_LCSC_GetAntiClockWise_State
  * @param  LCSCx LCSC Instance
  * @retval can be one of the following values
  * @arg LL_LCSC_SR_ACLKWISE_FSM_Q1
  * @arg LL_LCSC_SR_ACLKWISE_FSM_Q2
  * @arg LL_LCSC_SR_ACLKWISE_FSM_Q3
  * @arg LL_LCSC_SR_ACLKWISE_FSM_Q4
  */
__STATIC_INLINE uint32_t LL_LCSC_GetAntiClockWise_State(LCSC_TypeDef *LCSCx)
{
  return (uint32_t)(READ_BIT(LCSCx->SR, LCSC_SR_ACLKWISE_STATE) >> LCSC_SR_ACLKWISE_STATE_Pos);
}

/**
  * @brief  Get the last direction detected
  * @rmtoll SR          LAST_DIR       LL_LCSC_GetLastDirection
  * @param  LCSCx LCSC Instance
  * @retval can be one of the following values
  * @arg LL_LCSC_SR_LAST_DIR_UNKNOWN
  * @arg LL_LCSC_SR_LAST_DIR_CLOCKWISE
  * @arg LL_LCSC_SR_LAST_DIR_COUNTER_CLOCKWISE
  */
__STATIC_INLINE uint32_t LL_LCSC_GetLastDirection(LCSC_TypeDef *LCSCx)
{
  return (uint32_t)(READ_BIT(LCSCx->SR, LCSC_SR_LAST_DIR) >> LCSC_SR_LAST_DIR_Pos);
}

/**
  * @brief  Get the Minimum of CMP_LCAB_CNT reached during the measurement
  * @rmtoll STAT          MIN_LCAB_CNT       LL_LCSC_GetMin_Counter
  * @param  LCSCx LCSC Instance
  * @retval the Minimum of CMP_LCAB_CNT
  */
__STATIC_INLINE uint32_t LL_LCSC_GetMin_Counter(LCSC_TypeDef *LCSCx)
{
  return (uint32_t)(READ_BIT(LCSCx->STAT, LCSC_STAT_MIN_LCAB_CNT) >> LCSC_STAT_MIN_LCAB_CNT_Pos);
}

/**
  * @brief  Get the Maximum of CMP_LCAB_CNT reached during the measurement
  * @rmtoll STAT          MAX_LCAB_CNT       LL_LCSC_GetMax_Counter
  * @param  LCSCx LCSC Instance
  * @retval the Maximum of CMP_LCAB_CNT
  */
__STATIC_INLINE uint32_t LL_LCSC_GetMax_Counter(LCSC_TypeDef *LCSCx)
{
  return (uint32_t)(READ_BIT(LCSCx->STAT, LCSC_STAT_MAX_LCAB_CNT) >> LCSC_STAT_MAX_LCAB_CNT_Pos);
}

/**
  * @brief  Set the Minimum bound of CMP_LCAB_COUNT used when monitoring the MIN_LCAB_CNT
  * @rmtoll STAT          MIN_LCAB_CNT_BOUND       LL_LCSC_SetMin_CounterOutOfBound
  * @param  LCSCx LCSC Instance
  * @param  value parameter must be a number between 0 and 255 (form 0x0 to 0xff)
  * @retval None
  */
__STATIC_INLINE void LL_LCSC_SetMin_CounterOutOfBound(LCSC_TypeDef *LCSCx, uint32_t value)
{
  MODIFY_REG(LCSCx->STAT, LCSC_STAT_MIN_LCAB_CNT_BOUND, value << LCSC_STAT_MIN_LCAB_CNT_BOUND_Pos);
}

/**
  * @brief  Get the Minimum bound of CMP_LCAB_COUNT used when monitoring the MIN_LCAB_CNT
  * @rmtoll STAT          MIN_LCAB_CNT_BOUND       LL_LCSC_GetMin_CounterOutOfBound
  * @param  LCSCx LCSC Instance
  * @retval the Minimum bound of CMP_LCAB_COUNT
  */
__STATIC_INLINE uint32_t LL_LCSC_GetMin_CounterOutOfBound(LCSC_TypeDef *LCSCx)
{
  return (uint32_t)(READ_BIT(LCSCx->STAT, LCSC_STAT_MIN_LCAB_CNT_BOUND) >> LCSC_STAT_MIN_LCAB_CNT_BOUND_Pos);
}

/**
  * @brief  Set the Maximum bound of CMP_LCAB_COUNT used when monitoring the MAX_LCAB_CNT
  * @rmtoll STAT          MAX_LCAB_CNT_BOUND       LL_LCSC_SetMax_CounterOutOfBound
  * @param  LCSCx LCSC Instance
  * @param  value parameter must be a number between 0 and 255 (form 0x0 to 0xff)
  * @retval None
  */
__STATIC_INLINE void LL_LCSC_SetMax_CounterOutOfBound(LCSC_TypeDef *LCSCx, uint32_t value)
{
  MODIFY_REG(LCSCx->STAT, LCSC_STAT_MAX_LCAB_CNT_BOUND, value << LCSC_STAT_MAX_LCAB_CNT_BOUND_Pos);
}

/**
  * @brief  Get the Maximum bound of CMP_LCAB_COUNT used when monitoring the MAX_LCAB_CNT
  * @rmtoll STAT          MAX_LCAB_CNT_BOUND       LL_LCSC_GetMax_CounterOutOfBound
  * @param  LCSCx LCSC Instance
  * @retval the Maximum bound of CMP_LCAB_COUNT
  */
__STATIC_INLINE uint32_t LL_LCSC_GetMax_CounterOutOfBound(LCSC_TypeDef *LCSCx)
{
  return (uint32_t)(READ_BIT(LCSCx->STAT, LCSC_STAT_MAX_LCAB_CNT_BOUND) >> LCSC_STAT_MAX_LCAB_CNT_BOUND_Pos);
}

/**
  * @brief  Indicate if CLKWISE_F is enabled. Clock Wise Flag
  * @note   0: counter CLKWISE has not reached CLKWISE_THRES
  *         1: counter CLKWISE has reached CLKWISE_THRES
  * @rmtoll ISR          CLKWISE_F            LL_LCSC_IsActiveFlag_CLKWISE
  * @param  LCSCx LCSC Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_LCSC_IsActiveFlag_CLKWISE(LCSC_TypeDef *LCSCx)
{
  return ((READ_BIT(LCSCx->ISR, LCSC_ISR_CLKWISE_F) == (LCSC_ISR_CLKWISE_F)) ? 1U : 0U);
}

/**
  * @brief  Clear LCSC. Clock Wise Flag
  * @rmtoll ISR          CLKWISE_F            LL_LCSC_ClearFlag_CLKWISE
  * @param  LCSCx LCSC Instance
  * @retval None
  */
__STATIC_INLINE void LL_LCSC_ClearFlag_CLKWISE(LCSC_TypeDef *LCSCx)
{
  WRITE_REG(LCSCx->ISR, LCSC_ISR_CLKWISE_F);
}

/**
  * @brief  Indicate if ACLKWISE_F is enabled. Anti Clock Wise Flag
  * @note   0: counter ACLKWISE has not reached ACLKWISE_THRES
  *         1: counter CLKWISE has reached CLKWISE_THRES
  * @rmtoll ISR          ACLKWISE_F            LL_LCSC_IsActiveFlag_ACLKWISE
  * @param  LCSCx LCSC Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_LCSC_IsActiveFlag_ACLKWISE(LCSC_TypeDef *LCSCx)
{
  return ((READ_BIT(LCSCx->ISR, LCSC_ISR_ACLKWISE_F) == (LCSC_ISR_ACLKWISE_F)) ? 1U : 0U);
}

/**
  * @brief  Clear LCSC. Anti Clock Wise Flag
  * @rmtoll ISR          ACLKWISE_F            LL_LCSC_ClearFlag_ACLKWISE
  * @param  LCSCx LCSC Instance
  * @retval None
  */
__STATIC_INLINE void LL_LCSC_ClearFlag_ACLKWISE(LCSC_TypeDef *LCSCx)
{
  WRITE_REG(LCSCx->ISR, LCSC_ISR_ACLKWISE_F);
}

/**
  * @brief  Indicate if TAMP_F is enabled. Tamper Flag
  * @note   0: tamper not detected
  *         1: tamper detected
  * @rmtoll ISR          TAMP_F            LL_LCSC_IsActiveFlag_TAMP
  * @param  LCSCx LCSC Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_LCSC_IsActiveFlag_TAMP(LCSC_TypeDef *LCSCx)
{
  return ((READ_BIT(LCSCx->ISR, LCSC_ISR_TAMP_F) == (LCSC_ISR_TAMP_F)) ? 1U : 0U);
}

/**
  * @brief  Clear LCSC. Tamper Flag
  * @rmtoll ISR          TAMP_F            LL_LCSC_ClearFlag_TAMP
  * @param  LCSCx LCSC Instance
  * @retval None
  */
__STATIC_INLINE void LL_LCSC_ClearFlag_TAMP(LCSC_TypeDef *LCSCx)
{
  WRITE_REG(LCSCx->ISR, LCSC_ISR_TAMP_F);
}

/**
  * @brief  Indicate if CNT_OFB_F is enabled. Out of Bound Counter Flag
  * @note   0: Out of Bound not detected
  *         1: Out of Bound detected
  * @rmtoll ISR          CNT_OFB_F            LL_LCSC_IsActiveFlag_CNT_OFB
  * @param  LCSCx LCSC Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_LCSC_IsActiveFlag_CNT_OFB(LCSC_TypeDef *LCSCx)
{
  return ((READ_BIT(LCSCx->ISR, LCSC_ISR_CNT_OFB_F) == (LCSC_ISR_CNT_OFB_F)) ? 1U : 0U);
}

/**
  * @brief  Clear LCSC. Out of Bound Counter Flag
  * @rmtoll ISR          CNT_OFB_F            LL_LCSC_ClearFlag_CNT_OFB
  * @param  LCSCx LCSC Instance
  * @retval None
  */
__STATIC_INLINE void LL_LCSC_ClearFlag_CNT_OFB(LCSC_TypeDef *LCSCx)
{
  WRITE_REG(LCSCx->ISR, LCSC_ISR_CNT_OFB_F);
}


/**
  * @}
 */


/* Exported functions --------------------------------------------------------*/

/**
  * @}
 */

/**
  * @}
 */

#endif /* LCSC */

/**
  * @}
 */

#ifdef __cplusplus
}
#endif

#endif /* STM32WL3x_LL_LCSC_H */
